# 4. Creating Pandas Series

In [124]:
import pandas as pd

In [125]:
groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])

In [126]:
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [127]:
print('Groceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of', groceries.size, 'elements')

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements

In [128]:
print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)

The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [129]:
x = 'bananas' in groceries
y = 'bread' in groceries
print('Is banana an index label in Groceries:', x)
print('Is bread an index label in Groceries:', y)

Is banana an index label in Groceries: False
Is bread an index label in Groceries: True

# 5. Accessing and Deleting Elements in Pandas Series

In [130]:
groceries['eggs']

30

In [131]:
groceries[['milk', 'bread']]

milk     Yes
bread     No
dtype: object

In [132]:
groceries[0]

30

In [133]:
groceries[-1]

'No'

In [134]:
groceries[[0, 1]]

eggs      30
apples     6
dtype: object

In [135]:
groceries.loc[['eggs', 'apples']]

eggs      30
apples     6
dtype: object

In [136]:
groceries.iloc[[2, 3]]

milk     Yes
bread     No
dtype: object

In [137]:
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [138]:
groceries['eggs'] = 2

In [139]:
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [140]:
groceries.drop('apples')

eggs       2
milk     Yes
bread     No
dtype: object

In [141]:
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [142]:
groceries.drop('apples', inplace = True)

In [143]:
groceries

eggs       2
milk     Yes
bread     No
dtype: object

In [144]:
print('How many eggs do we need to buy:', groceries['eggs'])

How many eggs do we need to buy: 2

In [145]:
print('Do we need milk and bread:\n', groceries[['milk', 'bread']])

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

In [146]:
groceries['apples'] = 6

In [147]:
print('How many eggs and apples do we need to buy:\n', groceries.loc[['eggs', 'apples']])

How many eggs and apples do we need to buy:
 eggs      2
apples    6
dtype: object

In [148]:
print('How many eggs and apples do we need to buy:\n',  groceries[[0, 3]])

How many eggs and apples do we need to buy:
 eggs      2
apples    6
dtype: object

In [149]:
print('Do we need bread:\n', groceries[[2]])

Do we need bread:
 bread    No
dtype: object

In [150]:
groceries.drop('apples', inplace = True)
groceries

eggs       2
milk     Yes
bread     No
dtype: object

# 6. Arithmetic Operations on Pandas Series

In [151]:
fruits = pd.Series(data = [10, 6, 3], index = ['apples', 'oranges', 'bananas'])
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [152]:
print('Original grocery list of fruits:\n', fruits)

Original grocery list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64

In [153]:
print('fruits + 2:\n', fruits + 2)

fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64

In [154]:
print('fruits - 2:\n', fruits - 2)

fruits - 2:
 apples     8
oranges    4
bananas    1
dtype: int64

In [155]:
print('fruits * 2:\n', fruits * 2)

fruits * 2:
 apples     20
oranges    12
bananas     6
dtype: int64

In [156]:
print('fruits / 2:\n', fruits / 2)

fruits / 2:
 apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [157]:
import numpy as np
print('Original grocery list of fruits:\n', fruits)

Original grocery list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64

In [158]:
print('EXP(X) = \n', np.exp(fruits))

EXP(X) =
 apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [159]:
print('SQRT(X) = \n', np.sqrt(fruits))

SQRT(X) =
 apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [160]:
print('POW(X,2) = \n', np.power(fruits, 2))

POW(X,2) =
 apples     100
oranges     36
bananas      9
dtype: int64

In [161]:
print('Original grocery list of fruits:\n', fruits)

Original grocery list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64

In [162]:
print('Amount of bananas + 2 =', fruits['bananas'] + 2)

Amount of bananas + 2 = 5

In [163]:
print('Amount of apples - 2 =', fruits['apples'] - 2)

Amount of apples - 2 = 8

In [164]:
print('We double the amount of apples and oranges:\n', fruits[['apples', 'oranges']] * 2)

We double the amount of apples and oranges:
 apples     20
oranges    12
dtype: int64

In [165]:
print('We half the amount of apples and oranges:\n', fruits.loc[['apples', 'oranges']] / 2)

We half the amount of apples and oranges:
 apples     5.0
oranges    3.0
dtype: float64

In [166]:
groceries * 2

eggs          4
milk     YesYes
bread      NoNo
dtype: object

# 7. Quiz: Manipulate a Series

In [167]:
import pandas as pd

# Create a Pandas Series that contains the distance of some planets from the Sun.
# Use the name of the planets as the index to your Pandas Series, and the distance
# from the Sun as your data. The distance from the Sun is in units of 10^6 km

distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']

# Create a Pandas Series using the above data, with the name of the planets as
# the index and the distance from the Sun as your data.
dist_planets = pd.Series(data = distance_from_sun, index = planets)

# Calculate the number of minutes it takes sunlight to reach each planet. You can
# do this by dividing the distance from the Sun for each planet by the speed of light.
# Since in the data above the distance from the Sun is in units of 10^6 km, you can
# use a value for the speed of light of c = 18, since light travels 18 x 10^6 km/minute.
time_light = dist_planets / 18

In [168]:
dist_planets

Earth       149.6
Saturn     1433.5
Mars        227.9
Venus       108.2
Jupiter     778.6
dtype: float64

In [169]:
time_light

Earth       8.311111
Saturn     79.638889
Mars       12.661111
Venus       6.011111
Jupiter    43.255556
dtype: float64

In [170]:
# Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
close_planets = time_light[time_light < 40]
close_planets

Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

# 8. Creating Pandas DataFrames

In [171]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

In [172]:
print(type(items))

<class 'dict'>

In [173]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [174]:
data = {'Bob' : pd.Series(data = [245, 25, 55]),
         'Alice' : pd.Series(data = [40, 110, 500, 45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [175]:
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements')
print()
print('The data in shopping_carts is:\n', shopping_carts.values)
print()
print('The row index in shopping_carts is:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 10 elements

The data in shopping_carts is:
 [[ 245.  500.]
 [  nan   40.]
 [  nan  110.]
 [  25.   45.]
 [  55.   nan]]

The row index in shopping_carts is: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is: Index(['Bob', 'Alice'], dtype='object')

In [176]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [177]:
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [178]:
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [179]:
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}
df = pd.DataFrame(data)
df

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

In [180]:
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [181]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]
store_items = pd.DataFrame(items2)
store_items

   bikes  glasses  pants  watches
0     20      NaN     30       35
1     15     50.0      5       10

In [182]:
# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])

# We display the DataFrame
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

# 9. Accessing Elements in Pandas DataFrames

In [183]:
print(store_items)

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [184]:
print('How many bikes are in each store:\n', store_items[['bikes']])

How many bikes are in each store:
          bikes
store 1     20
store 2     15

In [185]:
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']])

How many bikes and pants are in each store:
          bikes  pants
store 1     20     30
store 2     15      5

In [186]:
print('What items are in Store 1:\n', store_items.loc[['store 1']])

What items are in Store 1:
          bikes  glasses  pants  watches
store 1     20      NaN     30       35

In [187]:
print('How many bikes are in Store 2:', store_items['bikes']['store 2'])

How many bikes are in Store 2: 15

In [188]:
store_items['shirts'] = [15,2]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

In [189]:
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

In [190]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index = ['store 3'])
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [191]:
store_items = store_items.append(new_store)
store_items

D:\Anaconda3\lib\site-packages\pandas\core\frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

In [192]:
store_items['new watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  pants  shirts  suits  watches  new watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

In [193]:
store_items.insert(4, 'shoes', [8,5,0])

In [194]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches  new watches
store 1     20      NaN     30    15.0      8   45.0       35          NaN
store 2     15     50.0      5     2.0      5    7.0       10         10.0
store 3     20      4.0     30     NaN      0    NaN       35         35.0

In [195]:
store_items.pop('new watches')

store 1     NaN
store 2    10.0
store 3    35.0
Name: new watches, dtype: float64

In [196]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN      0    NaN       35

In [197]:
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 3     20      4.0     30     NaN      0    NaN       35

In [198]:
store_items = store_items.rename(columns = {'bikes': 'hats'})
store_items

         hats  glasses  pants  shirts  shoes  suits  watches
store 3    20      4.0     30     NaN      0    NaN       35

In [199]:
store_items = store_items.rename(index = {'store 3': 'last store'})
store_items

            hats  glasses  pants  shirts  shoes  suits  watches
last store    20      4.0     30     NaN      0    NaN       35

In [200]:
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirts  shoes  suits  watches
pants
30       20      4.0     NaN      0    NaN       35

# 10. Dealing with NaN

In [201]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

In [202]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [203]:
x = store_items.isnull()
print(x)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

In [204]:
x = store_items.isnull().sum().sum()
print(x)

3

In [205]:
store_items.count()

bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

In [207]:
store_items.dropna(axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [208]:
store_items.dropna(axis=1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

In [209]:
store_items.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

In [210]:
store_items.fillna(method='ffill', axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [211]:
store_items.fillna(method='backfill', axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [212]:
store_items.interpolate(method='linear', axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [213]:
store_items.interpolate(method='linear', axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

# 11. Quiz: Manipulate a DataFrame

In [214]:
import pandas as pd
import numpy as np

# Since we will be working with ratings, we will set the precision of our 
# dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a
# series of books. The ratings given are in the range from 1 to 5, with 5 being
# the best score. The names of the books, the authors, and the ratings of each user
# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# Users that have np.nan values means that the user has not yet rated that book.
# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas
# automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
dat = {'Book Title' : books,
       'Author' : authors,
       'User 1' : user_1,
       'User 2' : user_2,
       'User 3' : user_3,
       'User 4' : user_4}


# Use the dictionary to create a Pandas DataFrame
book_ratings = pd.DataFrame(dat)

# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3',
# 'User 4' and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. HINT: you can use the fillna()
# function with the keyword inplace = True, to do this. Write your code below:

book_ratings.fillna(book_ratings.mean(), inplace = True)

# 12.  Loading Data into a Pandas DataFrame

In [215]:
google_stock = pd.read_cav('./GOOG.csv)

SyntaxError: EOL while scanning string literal (<ipython-input-215-6e921bdedcb5>, line 1)